# DefinitionBindingMapIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefinitionBindingMapIterator Class
Members See Also
---
An iterator to a parameter definition to parameter bindings map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class DefinitionBindingMapIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class DefinitionBindingMapIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class DefinitionBindingMapIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..DefinitionBindingMapIterator
# See Also
DefinitionBindingMapIterator Members
Autodesk.Revit.DB Namespace